spec/support/vcr_cassettes/bgs/service/create_person.yml

---
http_interactions:
- request:
    method: get
    uri: <BGS_BASE_URL>/VnpPersonWebServiceBean/VnpPersonService?WSDL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Host:
      - ".vba.va.gov"
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 16 Jul 2020 20:49:25 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml;charset=utf-8
    body:
      encoding: UTF-8
      string: |-
        <?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-b170407.2038 svn-revision#2eaca54d17a59d265c6fe886b7fd0027836c766c. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-b170407.2038 svn-revision#2eaca54d17a59d265c6fe886b7fd0027836c766c. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://personService.services.vonapp.vba.va.gov/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://personService.services.vonapp.vba.va.gov/" name="VnpPersonService">
        <types>
        <xsd:schema>
        <xsd:import namespace="http://personService.services.vonapp.vba.va.gov/" schemaLocation="http://linktestbepbenefits.vba.va.gov:80/VnpPersonWebServiceBean/VnpPersonService?xsd=1"/>
        </xsd:schema>
        </types>
        <message name="findAllAsArray">
        <part name="parameters" element="tns:findAllAsArray"/>
        </message>
        <message name="findAllAsArrayResponse">
        <part name="parameters" element="tns:findAllAsArrayResponse"/>
        </message>
        <message name="MessageFaultException">
        <part name="fault" element="tns:MessageFaultException"/>
        </message>
        <message name="vnpPersonCreate">
        <part name="parameters" element="tns:vnpPersonCreate"/>
        </message>
        <message name="vnpPersonCreateResponse">
        <part name="parameters" element="tns:vnpPersonCreateResponse"/>
        </message>
        <message name="vnpPersonUpdate">
        <part name="parameters" element="tns:vnpPersonUpdate"/>
        </message>
        <message name="vnpPersonUpdateResponse">
        <part name="parameters" element="tns:vnpPersonUpdateResponse"/>
        </message>
        <message name="vnpPersonRemove">
        <part name="parameters" element="tns:vnpPersonRemove"/>
        </message>
        <message name="vnpPersonRemoveResponse">
        <part name="parameters" element="tns:vnpPersonRemoveResponse"/>
        </message>
        <message name="vnpPersonFindByPrimaryKey">
        <part name="parameters" element="tns:vnpPersonFindByPrimaryKey"/>
        </message>
        <message name="vnpPersonFindByPrimaryKeyResponse">
        <part name="parameters" element="tns:vnpPersonFindByPrimaryKeyResponse"/>
        </message>
        <portType name="VnpPersonService">
        <operation name="findAllAsArray">
        <input wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/findAllAsArrayRequest" message="tns:findAllAsArray"/>
        <output wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/findAllAsArrayResponse" message="tns:findAllAsArrayResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/findAllAsArray/Fault/MessageFaultException"/>
        </operation>
        <operation name="vnpPersonCreate">
        <input wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonCreateRequest" message="tns:vnpPersonCreate"/>
        <output wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonCreateResponse" message="tns:vnpPersonCreateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonCreate/Fault/MessageFaultException"/>
        </operation>
        <operation name="vnpPersonUpdate">
        <input wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonUpdateRequest" message="tns:vnpPersonUpdate"/>
        <output wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonUpdateResponse" message="tns:vnpPersonUpdateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonUpdate/Fault/MessageFaultException"/>
        </operation>
        <operation name="vnpPersonRemove">
        <input wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonRemoveRequest" message="tns:vnpPersonRemove"/>
        <output wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonRemoveResponse" message="tns:vnpPersonRemoveResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonRemove/Fault/MessageFaultException"/>
        </operation>
        <operation name="vnpPersonFindByPrimaryKey">
        <input wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonFindByPrimaryKeyRequest" message="tns:vnpPersonFindByPrimaryKey"/>
        <output wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonFindByPrimaryKeyResponse" message="tns:vnpPersonFindByPrimaryKeyResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonFindByPrimaryKey/Fault/MessageFaultException"/>
        </operation>
        </portType>
        <binding name="VnpPersonServicePortBinding" type="tns:VnpPersonService">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="findAllAsArray">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPersonCreate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPersonUpdate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPersonRemove">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPersonFindByPrimaryKey">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        </binding>
        <service name="VnpPersonService">
        <port name="VnpPersonServicePort" binding="tns:VnpPersonServicePortBinding">
        <soap:address location="http://linktestbepbenefits.vba.va.gov:80/VnpPersonWebServiceBean/VnpPersonService"/>
        </port>
        </service>
        </definitions>
  recorded_at: Thu, 16 Jul 2020 20:49:25 GMT
- request:
    method: post
    uri: <BGS_BASE_URL>/VnpPersonWebServiceBean/VnpPersonService
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://personService.services.vonapp.vba.va.gov/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
          <wsse:UsernameToken>
            <wsse:Username>VAgovAPI</wsse:Username>
          </wsse:UsernameToken>
          <vaws:VaServiceHeaders xmlns:vaws="http://vbawebservices.vba.va.gov/vawss">
            <vaws:CLIENT_MACHINE>10.0.0.149</vaws:CLIENT_MACHINE>
            <vaws:STN_ID>281</vaws:STN_ID>
            <vaws:applicationName>VAgovAPI</vaws:applicationName>
            <vaws:ExternalUid>89910845094761314</vaws:ExternalUid>
            <vaws:ExternalKey>abraham.lincoln@vets.gov</vaws:ExternalKey>
          </vaws:VaServiceHeaders>
        </wsse:Security>
        </env:Header><env:Body><tns:vnpPersonCreate><arg0><vnpProcId>3829671</vnpProcId><vnpPtcpntId>149456</vnpPtcpntId><firstNm>vet first name</firstNm><middleNm>vet middle name</middleNm><lastNm>vet last name</lastNm><suffixNm>Jr</suffixNm><brthdyDt>1969-04-07T00:00:00-05:00</brthdyDt><birthStateCd>FL</birthStateCd><birthCityNm xsi:nil="true"/><fileNbr>12345</fileNbr><ssnNbr>123341234</ssnNbr><deathDt>2020-01-01T00:00:00-05:00</deathDt><everMariedInd xsi:nil="true"/><vetInd>Y</vetInd><martlStatusTypeCd>Married</martlStatusTypeCd><jrnDt>2020-07-16T20:49:24Z</jrnDt><jrnLctnId>281</jrnLctnId><jrnStatusTypeCd>U</jrnStatusTypeCd><jrnUserId>VAgovAPI</jrnUserId><jrnObjId>VAgovAPI</jrnObjId><ssn>796043735</ssn></arg0></tns:vnpPersonCreate></env:Body></env:Envelope>
    headers:
      Host:
      - ".vba.va.gov"
      Soapaction:
      - '"vnpPersonCreate"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '1640'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 16 Jul 2020 20:49:26 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><work:WorkContext
        xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXdKABR3ZWJsb2dpYy5hcHAudm5wLWVhcgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQABTIuMC44AAA=</work:WorkContext></env:Header><S:Body><ns0:vnpPersonCreateResponse
        xmlns:ns0="http://personService.services.vonapp.vba.va.gov/"><return><vnpPtcpntId>149456</vnpPtcpntId><birthStateCd>FL</birthStateCd><brthdyDt>1969-04-06T23:00:00-06:00</brthdyDt><deathDt>2019-12-31T23:00:00-06:00</deathDt><fileNbr>12345</fileNbr><firstNm>vet
        first name</firstNm><jrnDt>2020-07-16T15:49:24-05:00</jrnDt><jrnLctnId>281</jrnLctnId><jrnObjId>VAgovAPI</jrnObjId><jrnStatusTypeCd>U</jrnStatusTypeCd><jrnUserId>VAgovAPI</jrnUserId><lastNm>vet
        last name</lastNm><martlStatusTypeCd>Married</martlStatusTypeCd><middleNm>vet
        middle name</middleNm><ssnNbr>123341234</ssnNbr><suffixNm>Jr</suffixNm><vetInd>Y</vetInd><vnpProcId>3829671</vnpProcId></return></ns0:vnpPersonCreateResponse></S:Body></S:Envelope>
  recorded_at: Thu, 16 Jul 2020 20:49:26 GMT
recorded_with: VCR 6.0.0
