spec/support/vcr_cassettes/claims_api/bgs/vnp_person_service/vnp_person_create/happy_path.yml

---
http_interactions:
- request:
    method: get
    uri: <BGS_BASE_URL>/VnpPersonWebServiceBean/VnpPersonService?WSDL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - <FARADAY_VERSION>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 01 Apr 2024 18:48:28 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml;charset=utf-8
      Strict-Transport-Security:
      - max-age=16000000; includeSubDomains; preload;
    body:
      encoding: UTF-8
      string: |-
        <?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-wls122140-b230824.1031 svn-revision#e4bad6ac24018736698e2952f77e76e7f403a9f1. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-wls122140-b230824.1031 svn-revision#e4bad6ac24018736698e2952f77e76e7f403a9f1. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://personService.services.vonapp.vba.va.gov/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://personService.services.vonapp.vba.va.gov/" name="VnpPersonService"><types><xsd:schema><xsd:import namespace="http://personService.services.vonapp.vba.va.gov/" schemaLocation="http://linktestbepbenefits.vba.va.gov:80/VnpPersonWebServiceBean/VnpPersonService?xsd=1"/></xsd:schema></types><message name="vnpPersonCreate"><part name="parameters" element="tns:vnpPersonCreate"/></message><message name="vnpPersonCreateResponse"><part name="parameters" element="tns:vnpPersonCreateResponse"/></message><message name="MessageFaultException"><part name="fault" element="tns:MessageFaultException"/></message><message name="vnpPersonUpdate"><part name="parameters" element="tns:vnpPersonUpdate"/></message><message name="vnpPersonUpdateResponse"><part name="parameters" element="tns:vnpPersonUpdateResponse"/></message><message name="vnpPersonRemove"><part name="parameters" element="tns:vnpPersonRemove"/></message><message name="vnpPersonRemoveResponse"><part name="parameters" element="tns:vnpPersonRemoveResponse"/></message><message name="vnpPersonFindByPrimaryKey"><part name="parameters" element="tns:vnpPersonFindByPrimaryKey"/></message><message name="vnpPersonFindByPrimaryKeyResponse"><part name="parameters" element="tns:vnpPersonFindByPrimaryKeyResponse"/></message><message name="findAllAsArray"><part name="parameters" element="tns:findAllAsArray"/></message><message name="findAllAsArrayResponse"><part name="parameters" element="tns:findAllAsArrayResponse"/></message><portType name="VnpPersonService"><operation name="vnpPersonCreate"><input wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonCreateRequest" message="tns:vnpPersonCreate"/><output wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonCreateResponse" message="tns:vnpPersonCreateResponse"/><fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonCreate/Fault/MessageFaultException"/></operation><operation name="vnpPersonUpdate"><input wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonUpdateRequest" message="tns:vnpPersonUpdate"/><output wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonUpdateResponse" message="tns:vnpPersonUpdateResponse"/><fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonUpdate/Fault/MessageFaultException"/></operation><operation name="vnpPersonRemove"><input wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonRemoveRequest" message="tns:vnpPersonRemove"/><output wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonRemoveResponse" message="tns:vnpPersonRemoveResponse"/><fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonRemove/Fault/MessageFaultException"/></operation><operation name="vnpPersonFindByPrimaryKey"><input wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonFindByPrimaryKeyRequest" message="tns:vnpPersonFindByPrimaryKey"/><output wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonFindByPrimaryKeyResponse" message="tns:vnpPersonFindByPrimaryKeyResponse"/><fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/vnpPersonFindByPrimaryKey/Fault/MessageFaultException"/></operation><operation name="findAllAsArray"><input wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/findAllAsArrayRequest" message="tns:findAllAsArray"/><output wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/findAllAsArrayResponse" message="tns:findAllAsArrayResponse"/><fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://personService.services.vonapp.vba.va.gov/VnpPersonService/findAllAsArray/Fault/MessageFaultException"/></operation></portType><binding name="VnpPersonServicePortBinding" type="tns:VnpPersonService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/><operation name="vnpPersonCreate"><soap:operation soapAction=""/><input><soap:body use="literal"/></input><output><soap:body use="literal"/></output><fault name="MessageFaultException"><soap:fault name="MessageFaultException" use="literal"/></fault></operation><operation name="vnpPersonUpdate"><soap:operation soapAction=""/><input><soap:body use="literal"/></input><output><soap:body use="literal"/></output><fault name="MessageFaultException"><soap:fault name="MessageFaultException" use="literal"/></fault></operation><operation name="vnpPersonRemove"><soap:operation soapAction=""/><input><soap:body use="literal"/></input><output><soap:body use="literal"/></output><fault name="MessageFaultException"><soap:fault name="MessageFaultException" use="literal"/></fault></operation><operation name="vnpPersonFindByPrimaryKey"><soap:operation soapAction=""/><input><soap:body use="literal"/></input><output><soap:body use="literal"/></output><fault name="MessageFaultException"><soap:fault name="MessageFaultException" use="literal"/></fault></operation><operation name="findAllAsArray"><soap:operation soapAction=""/><input><soap:body use="literal"/></input><output><soap:body use="literal"/></output><fault name="MessageFaultException"><soap:fault name="MessageFaultException" use="literal"/></fault></operation></binding><service name="VnpPersonService"><port name="VnpPersonServicePort" binding="tns:VnpPersonServicePortBinding"><soap:address location="http://linktestbepbenefits.vba.va.gov:80/VnpPersonWebServiceBean/VnpPersonService"/></port></service></definitions>
  recorded_at: Mon, 01 Apr 2024 18:48:28 GMT
- request:
    method: post
    uri: <BGS_BASE_URL>/VnpPersonWebServiceBean/VnpPersonService
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8" ?>
        <env:Envelope
          xmlns:xsd="http://www.w3.org/2001/XMLSchema"
          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
          xmlns:tns="http://personService.services.vonapp.vba.va.gov/"
          xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        >
          <env:Header>
            <wsse:Security
              xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
            >
              <wsse:UsernameToken>
                <wsse:Username>VAgovAPI</wsse:Username>
              </wsse:UsernameToken>
              <vaws:VaServiceHeaders
                xmlns:vaws="http://vbawebservices.vba.va.gov/vawss"
              >
                <vaws:CLIENT_MACHINE>127.0.0.1</vaws:CLIENT_MACHINE>
                <vaws:STN_ID>281</vaws:STN_ID>
                <vaws:applicationName>VAgovAPI</vaws:applicationName>
                <vaws:ExternalUid>xUid</vaws:ExternalUid>
                <vaws:ExternalKey>xKey</vaws:ExternalKey>
              </vaws:VaServiceHeaders>
            </wsse:Security>
          </env:Header>
          <env:Body>
            <tns:vnpPersonCreate>
              <arg0>
                <jrnDt>2024-04-01T18:48:27Z</jrnDt>
                <jrnLctnId>281</jrnLctnId>
                <jrnStatusTypeCd>U</jrnStatusTypeCd>
                <jrnUserId>VAgovAPI</jrnUserId>
                <jrnObjId>VAgovAPI</jrnObjId>
                <vnpProcId>3854545</vnpProcId>
                <vnpPtcpntId>182008</vnpPtcpntId>
                <firstNm>Tamara</firstNm>
                <lastNm>Ellis</lastNm>
              </arg0>
            </tns:vnpPersonCreate>
          </env:Body>
        </env:Envelope>
    headers:
      User-Agent:
      - <FARADAY_VERSION>
      Content-Type:
      - text/xml;charset=UTF-8
      Host:
      - ".vba.va.gov"
      Soapaction:
      - '"vnpPersonCreate"'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 01 Apr 2024 18:48:29 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
      Strict-Transport-Security:
      - max-age=16000000; includeSubDomains; preload;
    body:
      encoding: UTF-8
      string: |
        <?xml version='1.0' encoding='UTF-8' ?>
        <S:Envelope
          xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
          xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
        >
          <env:Header>
            <work:WorkContext xmlns:work="http://oracle.com/weblogic/soap/workarea/">
              rO0ABXdKABR3ZWJsb2dpYy5hcHAudm5wLWVhcgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQABTIuMC44AAA=
            </work:WorkContext>
          </env:Header>
          <S:Body>
            <ns0:vnpPersonCreateResponse
              xmlns:ns0="http://personService.services.vonapp.vba.va.gov/"
            >
              <return>
                <vnpPtcpntId>182008</vnpPtcpntId>
                <firstNm>Tamara</firstNm>
                <jrnDt>2024-04-01T13:48:27-05:00</jrnDt>
                <jrnLctnId>281</jrnLctnId>
                <jrnObjId>VAgovAPI</jrnObjId>
                <jrnStatusTypeCd>U</jrnStatusTypeCd>
                <jrnUserId>VAgovAPI</jrnUserId>
                <lastNm>Ellis</lastNm>
                <vnpProcId>3854545</vnpProcId>
              </return>
            </ns0:vnpPersonCreateResponse>
          </S:Body>
        </S:Envelope>
  recorded_at: Mon, 01 Apr 2024 18:48:29 GMT
recorded_with: VCR 6.2.0
